{
  "id": "crm-atc-immobilier",
  "title": "Custom CRM - ATC Immobilier",
  "description": "Complete CRM solution developed during work-study to optimize real estate management",
  "longDescription": "Commercial real estate CRM developed during work-study for ATC Immobilier (Aix-en-Provence). Complete autonomous design and development of a custom solution to optimize commercial property, client, and business process management.\n\nARCHITECTURE:\nFrontend/backend monorepo with Feature-Sliced Design (FSD) architecture. Next.js 16 frontend hosted on Vercel, Fastify 5 backend running on Bun with Drizzle ORM. PostgreSQL database with Supabase (Auth + Storage). Entirely refactored to V2 for scalability and maintainability.\n\nTECH STACK:\nFrontend: Next.js 16 + React 19, shadcn/ui (Radix + Tailwind CSS 4), Zustand + TanStack Query v5, React Hook Form + Zod 4, Mapbox GL, TipTap, XY Flow, nuqs\nBackend: Fastify 5 on Bun, Drizzle ORM (+ Drizzle Kit), Zod 4, Supabase (Auth + Storage), PostgreSQL, Pino (logging), Sharp (images), Googleapis, ExcelJS, Archiver\nTests: Vitest | Lint/Format: Biome\nIntegrated APIs: Pappers (SIREN/SIRET), Mapbox (geocoding), MySendingBox (postal mail), Make.com (email campaigns), Google APIs (documents), Ubiflow (listings export)\n\nFEATURES:\nCore modules: Location management (CRUD multi-photos, Mapbox geolocation, area calculations), accounts (auto SIREN/SIRET enrichment via Pappers), contacts, brands (fuzzy matching brand recognition), offers/requests with intelligent matching, calendar/activities, document generation (Google Slides, email templates)\n\nInteractive map: Mapbox GL with drawing tools, property visualization, clustering, geographic filtering\n\nAutomations: Automatic company enrichment (Pappers API), address normalization (Mapbox), commercial sheet generation (Google Slides), mass email campaigns (Make.com), intelligent demand↔offer matching (30+ criteria, multi-zone geographic with configurable radius), automatic export to Le Bon Coin (Ubiflow XML feed), brand recognition with Levenshtein distance\n\nAI Infrastructure: Integrated Mistral AI, web scraping (Puppeteer + Cheerio) for market intelligence, intelligent scoring system for property matching\n\nRESULTS:\nProduction solution managing thousands of properties, accounts and contacts. Complete automation of critical processes: document generation, email campaigns, address normalization, company data enrichment, listings export. Production monitoring with metrics, structured logs, health checks. Scalable architecture ready for advanced AI evolution.",
  "tags": ["Next.js", "React 19", "Fastify", "Bun", "Drizzle ORM", "Supabase", "TypeScript", "Mapbox", "shadcn/ui", "CRM"],
  "images": [],
  "githubUrl": "",
  "liveUrl": "",
  "featured": true,
  "date": "2025-01-15T00:00:00.000Z",
  "status": "in-progress"
}
