{
  "id": "crm-atc-immobilier",
  "title": "CRM Sur Mesure - ATC Immobilier",
  "description": "Solution CRM complète développée en alternance pour optimiser la gestion immobilière",
  "longDescription": "CRM immobilier commercial développé en alternance pour ATC Immobilier (Aix-en-Provence). Conception et développement complet en autonomie d'une solution sur mesure pour optimiser la gestion de biens commerciaux, clients et processus métier de l'agence.\n\nARCHITECTURE :\nMonorepo frontend/backend avec architecture Feature-Sliced Design (FSD). Frontend Next.js 16 hébergé sur Vercel, backend Fastify 5 sur Bun avec Drizzle ORM. Base de données PostgreSQL avec Supabase (Auth + Storage). Architecture entièrement refactorée en V2 pour scalabilité et maintenabilité.\n\nSTACK TECHNIQUE :\nFrontend : Next.js 16 + React 19, shadcn/ui (Radix + Tailwind CSS 4), Zustand + TanStack Query v5, React Hook Form + Zod 4, Mapbox GL, TipTap, XY Flow, nuqs\nBackend : Fastify 5 sur Bun, Drizzle ORM (+ Drizzle Kit), Zod 4, Supabase (Auth + Storage), PostgreSQL, Pino (logs), Sharp (images), Googleapis, ExcelJS, Archiver\nTests : Vitest | Lint/Format : Biome\nAPIs intégrées : Pappers (SIREN/SIRET), Mapbox (géocodage), MySendingBox (courrier postal), Make.com (email campaigns), Google APIs (documents), Ubiflow (export annonces)\n\nFONCTIONNALITÉS :\nModules core : Gestion emplacements (CRUD multi-photos, géolocalisation Mapbox, calculs surface), comptes (enrichissement auto SIREN/SIRET via Pappers), contacts, enseignes (fuzzy matching reconnaissance marques), offres/demandes avec matching intelligent, calendrier/activités, génération documents (Google Slides, templates emails)\n\nCarte interactive : Mapbox GL avec outils dessin, visualisation biens, clustering, filtrage géographique\n\nAutomatisations : Enrichissement entreprise automatique (Pappers API), normalisation adresses (Mapbox), génération fiches commerciales (Google Slides), campagnes email en masse (Make.com), matching intelligent demandes↔offres (30+ critères, multi-zones géographiques avec rayon configurable), export automatique vers Le Bon Coin (flux XML Ubiflow), reconnaissance marques avec distance Levenshtein\n\nInfrastructure IA : Mistral AI intégré, scraping web (Puppeteer + Cheerio) pour veille marché, système scoring intelligent pour matching biens\n\nRÉSULTATS :\nSolution en production gérant plusieurs milliers de biens, comptes et contacts. Automatisation complète des processus critiques : génération documents, campagnes email, normalisation adresses, enrichissement données entreprises, export annonces. Monitoring production avec metrics, logs structurés, health checks. Architecture scalable prête pour évolution IA avancée.",
  "tags": ["Next.js", "React 19", "Fastify", "Bun", "Drizzle ORM", "Supabase", "TypeScript", "Mapbox", "shadcn/ui", "CRM"],
  "images": [],
  "githubUrl": "",
  "liveUrl": "",
  "featured": true,
  "date": "2025-01-15T00:00:00.000Z",
  "status": "in-progress"
}
