{
  "id": "plateforme-saas-affiliation",
  "title": "Plateforme SaaS Multi-Tenant — Affiliation",
  "description": "Plateforme SaaS permettant de déployer et gérer des landing pages d'affiliation personnalisées sur domaines multiples, avec dashboard d'administration et analytics intégrés.",
  "longDescription": "Plateforme SaaS multi-tenant développée pour un client, permettant de déployer des sites d'affiliation personnalisés sur des domaines indépendants depuis un dashboard centralisé.\n\nARCHITECTURE :\nApplication Next.js 16 unique servant plusieurs domaines via un système de proxy (remplacement du middleware Next.js). Détection automatique du domaine, injection de headers, routage conditionnel admin/public. Architecture Feature-Sliced Design côté frontend. Base de données PostgreSQL via Supabase avec Row Level Security. Fonctions RPC serveur pour les agrégations analytiques.\n\nSTACK TECHNIQUE :\nFrontend : Next.js 16 + React 19, shadcn/ui (Radix + Tailwind CSS 4), Zustand, TanStack Query v5, React Hook Form + Zod 4, Three.js (animations 3D), react-fast-marquee, dnd-kit (drag & drop), nuqs\nBackend : Supabase (PostgreSQL + Auth + Storage), fonctions RPC serveur, Server Actions Next.js\nAnalytics : Système cookieless avec agrégations timezone-aware (date-fns-tz), comparaison de périodes, tracking par device/bouton/carte\n\nFONCTIONNALITÉS :\nMulti-tenancy : Chaque client dispose de son propre domaine avec thème personnalisable (couleurs oklch), hero configurable, SEO metadata, contenu légal, logo/favicon. Configuration JSONB flexible sans migration de schéma.\n\nDashboard admin : Gestion CRUD des sites et de la bibliothèque de partenaires. Associations site-partenaire avec drag & drop pour l'ordonnancement, badges personnalisés, cartes internes configurables, URLs de redirection par bouton.\n\nAnalytics cookieless : Tracking RGPD-friendly sans cookies. Agrégation serveur via RPC Supabase. Statistiques par période (jour, semaine, mois, année) avec comparaison automatique. Répartition par device, taux de clic, performances par partenaire.\n\nAnimations premium : Blobs morphing CSS avec accélération GPU, particules flottantes pré-calculées (zero-jank), gradients animés. Optimisation responsive (tailles réduites sur mobile).\n\nInternationalisation : Support multilingue (FR/EN) par site, détection automatique de la locale.\n\nRÉSULTATS :\nPlateforme en production servant plusieurs domaines simultanément. Déploiement de nouveaux sites en minutes via le dashboard. Analytics temps réel sans dépendance externe.",
  "tags": ["Next.js", "React 19", "Supabase", "TypeScript", "Tailwind CSS", "shadcn/ui", "Three.js", "Analytics", "Multi-Tenant", "SaaS"],
  "images": [],
  "githubUrl": "",
  "liveUrl": "",
  "featured": true,
  "date": "2025-06-01T00:00:00.000Z",
  "status": "completed"
}
