{
  "id": "tracker-analytics",
  "title": "Tracker Analytics - Plateforme d'Analytics Privacy-First",
  "description": "Plateforme d'analytics web sans cookies avec tracking anonyme, dashboard temps réel et gestion multi-sites",
  "longDescription": "Plateforme d'analytics web privacy-first développée en freelance pour des clients business. Solution complète permettant de suivre le trafic de sites web sans cookies ni bannière de consentement, grâce à un système d'identification anonyme par hash quotidien rotatif.\n\nARCHITECTURE :\nApplication Next.js 16 full-stack déployée sur Vercel. Base de données PostgreSQL avec Drizzle ORM (7 tables : sites, events, users, userSites, auditLogs, sessions, passwordResetTokens). Script de tracking léger (~3.4 KB) injecté côté client via balise script. API REST avec endpoint de collecte CORS cross-origin, authentification par sessions httpOnly et protection CSRF.\n\nSTACK TECHNIQUE :\nNext.js 16 + React 19, TypeScript 5, Tailwind CSS 4, shadcn/ui (Radix), Recharts (graphiques), Drizzle ORM + PostgreSQL (postgres-js), Resend (emails transactionnels), ua-parser-js (parsing User-Agent), PWA (Service Worker, install prompt, pull-to-refresh)\nSécurité : scrypt (N=32768, r=8, p=2), sessions 8h httpOnly, CSRF middleware, rate limiting (30 req/10s par IP), CSP headers\n\nFONCTIONNALITÉS :\nTracking automatique : Pageviews (chargement + navigation SPA), clics sortants, clics téléphone (tel:), clics email (mailto:), soumissions formulaires, clics CTA (data-track=\"cta\"), événements custom (API JSON, max 1 KB). Système heartbeat 30s pour mesure précise de la durée de session.\n\nDashboard temps réel : Statistiques visiteurs/pageviews avec comparaison par période (7j/30j/12m/custom), top pages, sources de trafic (referrers), répartition devices (desktop/mobile/tablette + navigateur + OS), données géographiques (pays), suivi des conversions par type d'événement, graphique journalier (Recharts), durée moyenne de session, clics sortants, filtre par page.\n\nPanel admin : Gestion multi-sites (CRUD, snippets d'intégration copiables), gestion clients (création, édition, assignation sites, reset mot de passe), journal d'audit paginé (20 entrées/page) avec IP et horodatage.\n\nPrivacy by design : Zéro cookie, visitor ID anonyme (hash SHA-256 quotidien de date + IP + User-Agent + salt, rotation journalière), validation d'origine (domaine enregistré), aucun stockage d'IP en base.\n\nRapports automatisés : Emails hebdomadaires et mensuels via Resend avec résumé des statistiques par site. Page de documentation intégrée avec guides d'intégration (WordPress, Webflow, Shopify, Next.js).\n\nPWA : Service Worker pour support offline, prompt d'installation, pull-to-refresh mobile, icônes responsive (192x512px, maskable).\n\nRÉSULTATS :\nSolution en production servant plusieurs sites clients. Tracking conforme RGPD sans consentement requis. Script ultra-léger n'impactant pas les performances des sites trackés. Dashboard complet remplaçant Google Analytics pour des clients souhaitant une alternative privacy-first. Architecture serverless scalable sur Vercel avec pool de connexions optimisé.",
  "tags": ["Next.js", "React 19", "TypeScript", "PostgreSQL", "Drizzle ORM", "Tailwind CSS", "Recharts", "PWA", "Analytics", "Privacy"],
  "images": [],
  "githubUrl": "",
  "liveUrl": "",
  "featured": true,
  "date": "2026-01-15T00:00:00.000Z",
  "status": "completed"
}
